{
  "PARENTING_STYLE": [
    {
      "id": 0,
      "name": "Parent Sacrificed",
      "description": "Their offspring survive because their parents die—a terrible byproduct of the birthing process for these aliens. These parents may have forgone food to care for their young. Maybe they give their offspring food and shelter with their own bodies. In any case, these parents make the ultimate sacrifice for their children and will not see them mature.",
      "rarity_class": "COMMON"
    },
    {
      "id": 1,
      "name": "Absent Parents",
      "description": "Their offspring are born into the world without any natural caretakers. Individuals of the species survive all on their own from birth.",
      "rarity_class": "UNCOMMON"
    },
    {
      "id": 2,
      "name": "Pouches",
      "description": "These aliens have pouches or specially made adaptations to protect and carry their young. This might foster an intense, individualized bond between caretaker and child. As this species grows, the children will leave the proverbial nest.",
      "rarity_class": "COMMON"
    },
    {
      "id": 3,
      "name": "Raised by Parents",
      "description": "This species as parents stay close to their offspring and provide food, shelter and other necessities. The parents are the primary caretakers. They stick around at least until their children have matured. These family ties may last lifetimes.",
      "rarity_class": "COMMON"
    },
    {
      "id": 4,
      "name": "Unrelated Species",
      "description": "Their offspring are raised by unrelated guardians or even an entirely different species. This could involve anything from trickery to a mutualist relationship. However, this process is typically hardwired in alien biology, and isn't a mere social contract.",
      "rarity_class": "UNCOMMON"
    },
    {
      "id": 5,
      "name": "Communal",
      "description": "Their offspring are raised by a whole community. Responsibility for rearing the young are not solely or even primarily placed on the individual parents. Instead, these aliens help ensure the safety of all their offspring by collectively working together.",
      "rarity_class": "COMMON"
    },
    {
      "id": 6,
      "name": "Competitive",
      "description": "These offspring are born competing with their own family. Whether it's fending off their siblings or saving themselves from their parents, these offspring must survive attacks from their family members if they are to make it to adulthood.",
      "rarity_class": "RARE"
    },
    {
      "id": 7,
      "name": "Instant Consciousness",
      "description": "Their offspring are born with amazing cognitive abilities or can mostly function in their society right away. They might be surprisingly conscious, or at the very least they can learn new things in a short amount of time.",
      "rarity_class": "EXTRAORDINARY"
    }
  ],

  "REPRODUCTION": [
    {
      "id": 0,
      "name": "Asexual",
      "description": "They reproduce asexually. Individuals can produce offspring all on their own without the need of any partner. Genetic mutations still occur to allow for adaptive evolution.",
      "rarity_class": "COMMON"
    },
    {
      "id": 1,
      "name": "Intimate Contact",
      "description": "They reproduce through intimate sexual contact, requiring genetic material from at least one more partner. One of the partners probably carries a fertilized egg to term.",
      "rarity_class": "COMMON"
    },
    {
      "id": 2,
      "name": "No-contact Fertilization",
      "description": "They reproduce through no-contact fertilization. This could be something like releasing spores into the air, or leaving eggs somewhere to be fertilized by another individual later. Genetic material is released and exchanged without touch.",
      "rarity_class": "COMMON"
    },
    {
      "id": 3,
      "name": "Requires Other Species",
      "description": "They reproduce in a specially evolved way that requires a member of another species. This could include intercouse with other aliens or it could be a parasitic process. It could even be something as rare as genetically rewriting other species to transform them into new alien members. In any case, they rely on another species to reproduce or birth their offspring.",
      "rarity_class": "UNCOMMON"
    },
    {
      "id": 4,
      "name": "Simple Touch",
      "description": "They reproduce by simple touch. Even a handshake can have enough genetic material for this species to repopulate. This could have wider social implications.",
      "rarity_class": "RARE"
    },
    {
      "id": 5,
      "name": "Eusocial",
      "description": "They reproduce as part of a eusocial order. They have a small number of breeding members that pass along DNA. The rest are sterile and lack genetic diversity, but are still vital to the survival of the whole species in various other roles.",
      "rarity_class": "COMMON"
    },
    {
      "id": 6,
      "name": "Psychic Sex",
      "description": "They reproduce using telepathy. Genes are passed on - or fertilization occurs - through a mind meld, transcending the physicality of sex.",
      "rarity_class": "RARE"
    },
    {
      "id": 7,
      "name": "Cloning",
      "description": "They reproduce using cloning technologies. Something may have happened to make this species sterile, or there may be socially enforced restrictions on the reproduction. Either way, offspring are an exact copy of the \"parents\".",
      "rarity_class": "UNCOMMON"
    },
    {
      "id": 8,
      "name": "Abiogenesis",
      "description": "They reproduce through abiogenesis: creating life out of non-living matter. The exact process is arcane and kept secret, but these products are clearly lifeforms and have consciousness. This is similar to but different from a robotic Artificial Intelligence.",
      "rarity_class": "EXTRAORDINARY"
    },
    {
      "id": 9,
      "name": "Spontaneous Existence",
      "description": "Referred to as Quantum or Spontaneous Reproduction, these aliens simply appear out of nowhere and just exist. There are no genitalia of any kind, and no sexual or asexual processes happen. While they share much of the same DNA between each other, there are no natural ways for them to exchange genes, pass them on or procreate. How they just \"pop\" into existence is unknown, but just as undeniable.",
      "rarity_class": "EXTRAORDINARY"
    }
  ],

  "REPRODUCTION_ADDITIONS": [
    {
      "id": 0,
      "name": "Sexual Competition",
      "description": "They have also evolved under intense sexual competition. They may use elegant displays, have complicated courtships or have adapted body parts to attract potential mates.",
      "rarity_class": "UNCOMMON"
    },
    {
      "id": 1,
      "name": "Sexual Transformation",
      "description": "These aliens can also change sexes at will, or their sexes are interchangeable depending on environmental pressures.",
      "rarity_class": "UNCOMMON"
    },
    {
      "id": 2,
      "name": "Conditional Reproduction",
      "description": "They reproduce only under specific conditions or locations. Maybe there needs to be a certain temperature, or moisture level. Whatever it is, those conditions must be met before reproduction and incubation can even begin.",
      "rarity_class": "RARE"
    },
    {
      "id": 3,
      "name": "Regenerative Reproduction",
      "description": "They can also sometimes reproduce through Regeneration. If they are non-fatally dismembered in specific ways, the cut-off parts can grow into a new individual. Wounds heal and limbs grow back on the original alien.",
      "rarity_class": "EXTRAORDINARY"
    }
  ],

  "ANATOMY": [
    {
      "id": 0,
      "name": "Aquatic",
      "description": "This alien lives in a liquid environment and can breathe underwater. It can also swim comfortably. This alien has adapted to certain amounts of atmospheric pressure.",
      "rarity_class": "COMMON"
    },
    {
      "id": 1,
      "name": "Molluscan",
      "description": "This alien is squishy and slimy. It probably lacks a spine, but it might make up for that with a shell. Mollusks are vulnerable but also thrive in a variety of environments.",
      "rarity_class": "UNCOMMON"
    },
    {
      "id": 2,
      "name": "Extremophile",
      "description": "This alien thrives in hostile conditions where little else can survive. These conditions can range from toxic environments to space itself.",
      "rarity_class": "RARE"
    },
    {
      "id": 3,
      "name": "Exotic",
      "description": "This creature is made up of unsual matter such as a gas, plasma or liquid.",
      "rarity_class": "EXTRAORDINARY"
    },
    {
      "id": 4,
      "name": "Arthropod or Insectoid",
      "description": "This alien sports a hard exoskeleton or chitonous armor. It has multiple limbs and most resembles an insect, spider or arthropod.",
      "rarity_class": "COMMON"
    },
    {
      "id": 5,
      "name": "Avian",
      "description": "This species is at least partially feathered and has wings.",
      "rarity_class": "UNCOMMON"
    },
    {
      "id": 6,
      "name": "Reptilian",
      "description": "This species is cold blooded and is at least partially covered in scales. It might also shed its skin.",
      "rarity_class": "COMMON"
    },
    {
      "id": 7,
      "name": "Mammalian",
      "description": "This alien is furry and probably warm-blooded. Live birth is common and they have mammary glands.",
      "rarity_class": "COMMON"
    },
    {
      "id": 8,
      "name": "Arboreal",
      "description": "This alien thrives in the tall trees and canopies of jungles.",
      "rarity_class": "COMMON"
    },
    {
      "id": 9,
      "name": "Botanical",
      "description": "This alien is made up of matter such as stems, flowers and wood.",
      "rarity_class": "UNCOMMON"
    },
    {
      "id": 10,
      "name": "Fungal",
      "description": "This alien is made up of mycelium, molds or yeast.",
      "rarity_class": "RARE"
    }
  ],

  "ANATOMY_ADDITIONS": [
    {
      "id": 0,
      "name": "Mimicry",
      "description": "This alien has evolved to mimic the appearance of another species or plant, for safety or successful hunting.",
      "rarity_class": "EXTRAORDINARY"
    },
    {
      "id": 1,
      "name": "Stealth",
      "description": "This alien has evolved very good camouflage to conceal itself, and it might even turn invisible.",
      "rarity_class": "COMMON"
    },
    {
      "id": 2,
      "name": "Aposematism",
      "description": "This alien has evolved to display itself very openly as a warning for potential predators. This warning can come in the form of bright colors, loud sounds, strong smells, etc.",
      "rarity_class": "COMMON"
    },
    {
      "id": 3,
      "name": "Exoskeleton",
      "description": "This alien has an exoskeleton. This  can cover a part of the body or the whole animal. It may have to moult over the course of its lifetime.",
      "rarity_class": "RARE"
    },
    {
      "id": 4,
      "name": "Wings",
      "description": "This alien has wings of some kind and is able to fly or glide.",
      "rarity_class": "UNCOMMON"
    },
    {
      "id": 5,
      "name": "Tentacles",
      "description": "This alien has sensitive and flexible tentacles that can sense, grab or attack other animals.",
      "rarity_class": "UNCOMMON"
    },
    {
      "id": 6,
      "name": "Proboscis",
      "description": "This alien has a long, tube-like appendage from its mouth area. It can be used to handle objects, consume food directly, or simply be a sensitive organ.",
      "rarity_class": "UNCOMMON"
    },
    {
      "id": 7,
      "name": "Metamorphosis",
      "description": "This alien creature has multiple life stages. It completely transforms its looks and functions between these stages. This process is likely protected by cocooning or the alien developes inside a chrysalis.",
      "rarity_class": "RARE"
    },
    {
      "id": 8,
      "name": "Molting or Shedding",
      "description": "This species has evolved to shed the outer layer of its body. This may be in response to external stimuli, such as a change in season, or in the case of an exoskeleton, to grow a stronger or better-fitting outer layer. An individual of this species may be more vulnerable during this process.",
      "rarity_class": "COMMON"
    }
  ],

  "DIET": [
    {
      "id": 0,
      "name": "Photosynthesis",
      "description": "This alien transforms light energy into a sort of food source through Photosynthesis.",
      "rarity_class": "RARE"
    },
    {
      "id": 1,
      "name": "Minerals",
      "description": "This alien consumes minerals, and their diet could include rocks and crystals (or creatures made out of minerals).",
      "rarity_class": "UNCOMMON"
    },
    {
      "id": 2,
      "name": "Exotic",
      "description": "This alien consumes strange \"foods\" such as gases, plastics or even electricty.",
      "rarity_class": "RARE"
    },
    {
      "id": 3,
      "name": "Psychic or Energy",
      "description": "This alien consumes psychic or emotional energy for sustenance.",
      "rarity_class": "EXTRAORDINARY"
    },
    {
      "id": 4,
      "name": "Waste",
      "description": "This alien consumes the waste of other species, or otherwise cleans up the environment and other animals as part of its diet.",
      "rarity_class": "UNCOMMON"
    },
    {
      "id": 5,
      "name": "Decaying Matter",
      "description": "This alien consumes decaying matter such as dead animals or rotted wood.",
      "rarity_class": "UNCOMMON"
    },
    {
      "id": 6,
      "name": "Fluids",
      "description": "This alien consumes fluids such as nectar, sap or blood (or an animal made out of fluids).",
      "rarity_class": "COMMON"
    },
    {
      "id": 7,
      "name": "Parasitic",
      "description": "This alien feeds off another organism in a parasitic fashion. It syphon off any one kind of substance or energy from its host.",
      "rarity_class": "UNCOMMON"
    },
    {
      "id": 8,
      "name": "Herbivore",
      "description": "This alien eats plant matter or wood. Or an animal made out of this matter.",
      "rarity_class": "COMMON"
    },
    {
      "id": 9,
      "name": "Carnivore",
      "description": "This alien eats other animals and gets its energy from digesting live, organic matter.",
      "rarity_class": "COMMON"
    },
    {
      "id": 10,
      "name": "Omnivore",
      "description": "This alien consumes a large variety of matter that can range from plants to animals or other matter.",
      "rarity_class": "COMMON"
    }
  ],

  "DIET_STYLES": [
    {
      "id": 0,
      "name": "Ambushing",
      "description": "Individuals of this species emerge from a hiding place to ambush its prey.",
      "rarity_class": "COMMON"
    },
    {
      "id": 1,
      "name": "Going Solo",
      "description": "Individuals of this species forage or hunt on their own.",
      "rarity_class": "COMMON"
    },
    {
      "id": 2,
      "name": "Hunting With Pack",
      "description": "Individuals of this species hunt prey in packs.",
      "rarity_class": "COMMON"
    },
    {
      "id": 3,
      "name": "Herd Grazing",
      "description": "Individuals of this species graze in herds.",
      "rarity_class": "COMMON"
    },
    {
      "id": 4,
      "name": "Cooking",
      "description": "Individuals of this species cook their food to a desired temperature before consuming it.",
      "rarity_class": "RARE"
    },
    {
      "id": 5,
      "name": "Swallows Whole",
      "description": "Individuals of this species swallow their food whole.",
      "rarity_class": "UNCOMMON"
    },
    {
      "id": 6,
      "name": "Chews",
      "description": "Individuals of this species chew their food.",
      "rarity_class": "RARE"
    },
    {
      "id": 7,
      "name": "Sucks Nutrition Out",
      "description": "Individuals of this species suck the nutrients out of their food.",
      "rarity_class": "COMMON"
    },
    {
      "id": 8,
      "name": "Sucks Food In",
      "description": " Individuals of this species suck food into their mouths from a distance with great force.",
      "rarity_class": "UNCOMMON"
    },
    {
      "id": 9,
      "name": "Expels Acid",
      "description": "Individuals of this species expel their stomach acids out onto their food to digest it before eating.",
      "rarity_class": "COMMON"
    },
    {
      "id": 10,
      "name": "Roots",
      "description": "Individuals of this species put down a kind of root that transfers nutrients to the alien.",
      "rarity_class": "RARE"
    },
    {
      "id": 11,
      "name": "Steals",
      "description": "Individuals of this species steal food from other creatures. This isn't mere desperation, but rather a distinct technique developed during evolution.",
      "rarity_class": "UNCOMMON"
    },
    {
      "id": 12,
      "name": "Injection",
      "description": "Individuals of this species inject their food with compounds that digest it, paralyze it, poison it, etc.",
      "rarity_class": "UNCOMMON"
    },
    {
      "id": 13,
      "name": "Scavenging",
      "description": "Individuals of this species wait for a predator to finish eating its prey, and then pick up where that predator left off, eating the parts that others can't. They have evolved to gain nutrition from eating decomposing matter and are not affect by diseases from eating it.",
      "rarity_class": "COMMON"
    },
    {
      "id": 14,
      "name": "Gastrolith",
      "description": "Individuals of this species consume rocks or similar objects to help break food down in their stomachs.",
      "rarity_class": "UNCOMMON"
    },
    {
      "id": 15,
      "name": "Tearing, Ripping or Breaking Apart",
      "description": "Individuals of this species tear, rip or otherwise break their food apart.",
      "rarity_class": "COMMON"
    },
    {
      "id": 16,
      "name": "Trapping or Catching",
      "description": "Individuals of this species trap their food with tools, or otherwise use a sticky body part that specializes in catching food.",
      "rarity_class": "COMMON"
    },
    {
      "id": 17,
      "name": "Absorbs",
      "description": "Individuals of this species absorb nutrients through their skin (or skin-equivalent), in a process similar to osmosis.",
      "rarity_class": "EXTRAORDINARY"
    },
    {
      "id": 18,
      "name": "Paralyzes",
      "description": "Individuals of this species paralyze their prey or shut down certain functions and organs through toxins or sounds, etc.",
      "rarity_class": "UNCOMMON"
    }
  ],

  "DIET_ADDITIONS": [
    {
      "id": 0,
      "name": "Cannibalism",
      "description": "This species might also engage in cannibalism when pressured to.",
      "rarity_class": "RARE"
    },
    {
      "id": 1,
      "name": "Storage",
      "description": "This species will also store extra food in a space within their body or hide it someplace safe to find later.",
      "rarity_class": "RARE"
    },
    {
      "id": 2,
      "name": "Needs Food Badly",
      "description": "This animal also requires so much energy that it must eat more than it weighs multiple times a day. This animal also has a fast metabolism.",
      "rarity_class": "RARE"
    },
    {
      "id": 3,
      "name": "Slow Metabolism",
      "description": "This animal also does not need to eat frequently. It has a slow metabolism, and while it can survive long periods without food, it is also slower or must carefully conserve its energy.",
      "rarity_class": "EXTRAORDINARY"
    }
  ]
}
